
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>封装、继承、多态 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="值-引用传递.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    面向对象
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="面向对象相关概念.html">
            
                <a href="面向对象相关概念.html">
            
                    
                    什么是面向对象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="Java平台无关性.html">
            
                <a href="Java平台无关性.html">
            
                    
                    Java平台无关性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="值-引用传递.html">
            
                <a href="值-引用传递.html">
            
                    
                    值传递、引用传递
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.4" data-path="封装继承多态.html">
            
                <a href="封装继承多态.html">
            
                    
                    封装、继承、多态
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    Java基础知识
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../java_base/基本数据类型.html">
            
                <a href="../java_base/基本数据类型.html">
            
                    
                    基本数据类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../java_base/String类型.html">
            
                <a href="../java_base/String类型.html">
            
                    
                    String类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../java_base/Java关键字.html">
            
                <a href="../java_base/Java关键字.html">
            
                    
                    Java关键字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../java_base/Java集合.html">
            
                <a href="../java_base/Java集合.html">
            
                    
                    Java集合
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.4.1" data-path="../java_base/Collection.html">
            
                <a href="../java_base/Collection.html">
            
                    
                    Collection
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4.2" data-path="../java_base/Map.html">
            
                <a href="../java_base/Map.html">
            
                    
                    Map
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../java_base/enum.html">
            
                <a href="../java_base/enum.html">
            
                    
                    枚举
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="../java_base/java_io.html">
            
                <a href="../java_base/java_io.html">
            
                    
                    Java IO
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="../java_base/serializable.html">
            
                <a href="../java_base/serializable.html">
            
                    
                    序列化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="../java_base/annotation.html">
            
                <a href="../java_base/annotation.html">
            
                    
                    注解
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.9" data-path="../java_base/lambda.html">
            
                <a href="../java_base/lambda.html">
            
                    
                    Lambda
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    数据库知识
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../data_base/数据库索引.html">
            
                <a href="../data_base/数据库索引.html">
            
                    
                    数据库索引
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" >
            
                <span>
            
                    
                    数据库优化
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    数据结构
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../data_structure/red_black _tree.html">
            
                <a href="../data_structure/red_black _tree.html">
            
                    
                    红黑树
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    多线程与高并发
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="../线程.html">
            
                <a href="../线程.html">
            
                    
                    线程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" data-path="../Callable_Future_FutureTask.html">
            
                <a href="../Callable_Future_FutureTask.html">
            
                    
                    Callable、Future和FutureTask
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >封装、继承、多态</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x5C01;&#x88C5;&#x3001;&#x7EE7;&#x627F;&#x3001;&#x591A;&#x6001;">&#x5C01;&#x88C5;&#x3001;&#x7EE7;&#x627F;&#x3001;&#x591A;&#x6001;</h2>
<h4 id="41-&#x65B9;&#x6CD5;&#x91CD;&#x5199;&#x4E0E;&#x91CD;&#x8F7D;">4.1 &#x65B9;&#x6CD5;&#x91CD;&#x5199;&#x4E0E;&#x91CD;&#x8F7D;</h4>
<h6 id="411-&#x91CD;&#x5199;overriding">4.1.1 &#x91CD;&#x5199;(Overriding)</h6>
<p>&#x200B;        &#x5728;Java&#x4E2D;&#x5B50;&#x7C7B;&#x7EE7;&#x627F;&#x7236;&#x7C7B;&#x540E;&#x5177;&#x5907;&#x4E86;&#x7236;&#x7C7B;&#x6240;&#x6709;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x7EE7;&#x627F;&#x4E86;&#x7236;&#x7C7B;&#x6240;&#x6709;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x53D8;&#x91CF;&#x3002;&#x5F53;&#x5B50;&#x7C7B;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x7236;&#x7C7B;&#x7684;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#xFF0C;&#x589E;&#x5F3A;&#x529F;&#x80FD;&#x65F6;&#xFF0C;&#x5C06;&#x8FD9;&#x79CD;&#x64CD;&#x4F5C;&#x79F0;&#x4E3A;&#x91CD;&#x5199;&#xFF0C;&#x5B83;&#x4F7F;&#x5B50;&#x7C7B;&#x65E2;&#x53EF;&#x4EE5;&#x9690;&#x85CF;&#x548C;&#x8BBF;&#x95EE;&#x7236;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8986;&#x76D6;&#x7EE7;&#x627F;&#x7236;&#x7C7B;&#x65B9;&#x6CD5;&#x3002;<strong>&#x91CD;&#x5199;&#x662F;&#x6307;&#x5B50;&#x7C7B;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x4E0E;&#x7236;&#x7C7B;&#x4E2D;&#x7EE7;&#x627F;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x540D;&#x3001;&#x53C2;&#x6570;&#x5217;&#x8868;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#x3002;</strong>&#x5F53;&#x5B50;&#x7C7B;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x8C03;&#x7528;&#x7236;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x65F6;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<strong>supper</strong>&#x5173;&#x952E;&#x5B57;&#x3002;&#x91CD;&#x5199;&#x9700;&#x8981;&#x9075;&#x5FAA;&#x4EE5;&#x4E0B;&#x89C4;&#x5219;&#xFF1A;
(1) &#x7236;&#x7C7B;&#x65B9;&#x6CD5;&#x7684;&#x53C2;&#x6570;&#x5217;&#x8868;&#x5FC5;&#x987B;&#x5B8C;&#x5168;&#x4E0E;&#x88AB;&#x5B50;&#x7C7B;&#x91CD;&#x5199;&#x7684;&#x65B9;&#x6CD5;&#x7684;&#x53C2;&#x6570;&#x5217;&#x8868;&#x76F8;&#x540C;&#x3002;
(2) &#x7236;&#x7C7B;&#x7684;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x5FC5;&#x987B;&#x4E0E;&#x88AB;&#x5B50;&#x7C7B;&#x91CD;&#x5199;&#x7684;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x76F8;&#x540C;&#x3002;
(3) &#x88AB;&#x5B50;&#x7C7B;&#x91CD;&#x5199;&#x7684;&#x65B9;&#x6CD5;&#x4E0D;&#x80FD;&#x62E5;&#x6709;&#x6BD4;&#x7236;&#x7C7B;&#x65B9;&#x6CD5;&#x66F4;&#x52A0;&#x4E25;&#x683C;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x3002;
(4) &#x7236;&#x7C7B;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x4FEE;&#x9970;&#x7B26;&#x7684;&#x9650;&#x5236;&#x4E00;&#x5B9A;&#x8981;&#x5927;&#x4E8E;&#x88AB;&#x5B50;&#x7C7B;&#x91CD;&#x5199;&#x65B9;&#x6CD5;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x4FEE;&#x9970;&#x7B26;&#x3002;
(5) &#x7236;&#x7C7B;&#x5F53;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#xFF0C;&#x5B50;&#x7C7B;&#x5728;&#x91CD;&#x5199;&#x7236;&#x7C7B;&#x7684;&#x8BE5;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x4E5F;&#x8981;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#xFF0C;&#x800C;&#x4E14;&#x629B;&#x51FA;&#x7684;&#x5F02;&#x5E38;&#x4E0D;&#x80FD;&#x591A;&#x4E8E;&#x7236;&#x7C7B;&#x4E2D;&#x629B;&#x51FA;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x4F46;&#x88AB;&#x91CD;&#x5199;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x58F0;&#x660E;&#x66F4;&#x52A0;&#x5BBD;&#x6CDB;&#x7684;&#x68C0;&#x67E5;&#x578B;&#x5F02;&#x5E38;&#x3002;</p>
<h6 id="412-&#x91CD;&#x8F7D;">4.1.2 &#x91CD;&#x8F7D;</h6>
<p>&#x200B;        &#x91CD;&#x8F7D;&#x662F;&#x6307;&#x5728;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#xFF0C;&#x591A;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x65B9;&#x6CD5;&#x540D;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x662F;&#x53C2;&#x6570;&#x5217;&#x8868;&#x4E0D;&#x540C;&#x3002;&#x53C2;&#x6570;&#x5217;&#x8868;&#x4E0D;&#x540C;&#x6307;&#x7684;&#x662F;&#x53C2;&#x6570;&#x4E2A;&#x6570;&#x3001;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x6216;&#x8005;&#x53C2;&#x6570;&#x7684;&#x987A;&#x5E8F;&#x4E0D;&#x540C;&#x3002;&#x65B9;&#x6CD5;&#x91CD;&#x8F7D;&#x53EF;&#x4EE5;&#x4F7F;&#x7C7B;&#x5177;&#x6709;&#x5904;&#x7406;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5728;&#x8C03;&#x7528;&#x65B9;&#x6CD5;&#x65F6;&#x6839;&#x636E;&#x4F20;&#x9012;&#x6765;&#x7684;&#x53C2;&#x6570;&#x7684;&#x4E2A;&#x6570;&#x53CA;&#x7C7B;&#x578B;&#x7684;&#x4E0D;&#x540C;&#x6765;&#x51B3;&#x5B9A;&#x4F7F;&#x7528;&#x54EA;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x591A;&#x6001;&#x3002;&#x5728;&#x8FDB;&#x884C;&#x65B9;&#x6CD5;&#x91CD;&#x8F7D;&#x65F6;&#x5E94;&#x8BE5;&#x6CE8;&#x610F;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#xFF1A;
(1)&#x5728;&#x4F7F;&#x7528;&#x91CD;&#x8F7D;&#x65F6;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x4E0D;&#x540C;&#x7684;&#x53C2;&#x6570;&#x5217;&#x8868;&#xFF0C;&#x5FC5;&#x987B;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x53C2;&#x6570;&#x5217;&#x8868;&#x3002;
(2)&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x3001;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x3001;&#x629B;&#x51FA;&#x7684;&#x5F02;&#x5E38;&#x8FDB;&#x884C;&#x91CD;&#x8F7D;&#x3002;
(3)&#x65B9;&#x6CD5;&#x7684;&#x5F02;&#x5E38;&#x7C7B;&#x578B;&#x548C;&#x6570;&#x76EE;&#x4E0D;&#x4F1A;&#x5BF9;&#x91CD;&#x8F7D;&#x9020;&#x6210;&#x5F71;&#x54CD;&#x3002;
(4)&#x53EF;&#x4EE5;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#xFF0C;&#x53EA;&#x8981;&#x53C2;&#x6570;&#x5217;&#x8868;&#x4E0D;&#x540C;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;
(5)&#x53EF;&#x4EE5;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x8BBF;&#x95EE;&#x4FEE;&#x9970;&#x7B26;&#x3002;
(6)&#x53EF;&#x4EE5;&#x629B;&#x51FA;&#x4E0D;&#x540C;&#x7684;&#x5F02;&#x5E38;&#x3002;</p>
<h4 id="42-java&#x7684;&#x7EE7;&#x627F;&#x4E0E;&#x5B9E;&#x73B0;">4.2 Java&#x7684;&#x7EE7;&#x627F;&#x4E0E;&#x5B9E;&#x73B0;</h4>
<h6 id="421-&#x7EE7;&#x627F;">4.2.1 &#x7EE7;&#x627F;</h6>
<p>&#x200B;        &#x5982;&#x679C;&#x6709;&#x82E5;&#x5E72;&#x4E2A;&#x7C7B;&#x4E2D;&#x6709;&#x90E8;&#x5206;&#x529F;&#x80FD;&#x76F8;&#x540C;&#xFF0C;&#x5C06;&#x76F8;&#x540C;&#x7684;&#x90E8;&#x5206;&#x62BD;&#x53D6;&#x51FA;&#x6765;&#x653E;&#x5165;&#x7236;&#x7C7B;&#x4E2D;&#xFF0C;&#x8BA9;&#x82E5;&#x5E72;&#x7C7B;&#x7EE7;&#x627F;&#x8FD9;&#x4E2A;&#x7236;&#x7C7B;&#x3002;&#x7EE7;&#x627F;&#x662F;&#xFF1A;<strong>&#x4EC0;&#x4E48;&#x662F;&#x4E00;&#x79CD;&#x4EC0;&#x4E48;&#xFF0C;&#x7EE7;&#x627F;&#x4F20;&#x8FBE;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF1A;is-a</strong>&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x732B; &#x662F;&#x4E00;&#x4E2A; &#x52A8;&#x7269;&#xFF0C;&#x732B;&#x5C31;&#x662F;&#x52A8;&#x7269;&#x7684;&#x5B50;&#x7C7B;</p>
<h6 id="422-&#x5B9E;&#x73B0;">4.2.2 &#x5B9E;&#x73B0;</h6>
<p>&#x200B;        &#x5982;&#x679C;&#x6709;&#x82E5;&#x5E72;&#x4E2A;&#x7C7B;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x5904;&#x7406;&#x76EE;&#x6807;&#xFF0C;&#x4F46;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x4E0D;&#x540C;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#xFF0C;&#x8BA9;&#x82E5;&#x5E72;&#x7C7B;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x7136;&#x540E;&#x5404;&#x81EA;&#x5B9E;&#x73B0;&#x81EA;&#x5DF1;&#x5177;&#x4F53;&#x7684;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x6765;&#x5904;&#x7406;&#x76EE;&#x6807;&#x3002;&#x63A5;&#x53E3;&#x662F;&#xFF1A;<strong>&#x5BF9;&#x529F;&#x80FD;&#x7684;&#x63CF;&#x8FF0;&#xFF08;&#x65B9;&#x6CD5;/&#x884C;&#x4E3A;&#xFF09;&#xFF0C;&#x63A5;&#x53E3;&#x4F20;&#x8FBE;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF1A;&#x62E5;&#x6709;&#x67D0;&#x79CD;&#x529F;&#x80FD;&#xFF0C;&#x80FD;&#x5E72;&#x561B;</strong>&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;Serializable&#x4EE3;&#x8868;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x3002;     </p>
<h6 id="423-&#x4E8C;&#x8005;&#x7684;&#x8054;&#x7CFB;">4.2.3 &#x4E8C;&#x8005;&#x7684;&#x8054;&#x7CFB;</h6>
<p>&#x200B;        &#x7EE7;&#x627F;&#x548C;&#x63A5;&#x53E3;&#x90FD;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#x91CD;&#x7528;&#xFF0C;&#x63D0;&#x9AD8;&#x5F00;&#x53D1;&#x6548;&#x7387;&#x3002;</p>
<h6 id="424-&#x4E8C;&#x8005;&#x7684;&#x533A;&#x522B;">4.2.4 &#x4E8C;&#x8005;&#x7684;&#x533A;&#x522B;</h6>
<ol>
<li>Java&#x7C7B;&#x53EA;&#x80FD;&#x7EE7;&#x627F;&#x4E00;&#x4E2A;&#x7236;&#x7C7B;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x591A;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x7B80;&#x79F0;&#xFF1A;&#x5355;&#x7EE7;&#x627F;&#xFF0C;&#x591A;&#x5B9E;&#x73B0;&#x3002;</li>
<li>&#x5728;&#x63A5;&#x53E3;&#x4E2D;&#x53EA;&#x80FD;&#x5B9A;&#x4E49;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x548C;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#xFF0C;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x7531;&#x7EE7;&#x627F;&#x7684;&#x5B50;&#x7C7B;&#x5B8C;&#x6210;&#x3002;&#x7236;&#x7C7B;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7C7B;&#xFF0C;&#xFF0C;&#x5B50;&#x7C7B;&#x53EF;&#x4EE5;&#x7EE7;&#x627F;&#x7236;&#x7C7B;&#x5C5E;&#x6027;&#x65B9;&#x6CD5;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x91CD;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;&#x65B9;&#x6CD5;&#x3002;</li>
</ol>
<h4 id="43-&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E0E;&#x9ED8;&#x8BA4;&#x6784;&#x9020;&#x51FD;&#x6570;">4.3 &#x6784;&#x9020;&#x51FD;&#x6570;&#x4E0E;&#x9ED8;&#x8BA4;&#x6784;&#x9020;&#x51FD;&#x6570;</h4>
<p>&#x200B;        &#x6784;&#x9020;&#x51FD;&#x6570;&#x662F;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x65F6;&#x5BF9;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#x7684;&#x51FD;&#x6570;&#x3002;&#x51FD;&#x6570;&#x540D;&#x4E0E;&#x7C7B;&#x540D;&#x76F8;&#x540C;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;(void&#x662F;&#x6CA1;&#x6709;&#x5177;&#x4F53;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#xFF1B;&#x6784;&#x9020;&#x51FD;&#x6570;&#x662F;&#x8FDE;&#x7C7B;&#x578B;&#x90FD;&#x6CA1;&#x6709;)&#x3002;&#x6784;&#x9020;&#x51FD;&#x6570;&#x53EA;&#x6709;&#x5728;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x65F6;&#x624D;&#x4F1A;&#x8C03;&#x7528;&#x6216;&#x5728;&#x6784;&#x9020;&#x51FD;&#x6570;&#x5185;&#x8C03;&#x7528;&#xFF0C;&#x4E0D;&#x80FD;&#x7531;&#x4E00;&#x822C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x3002;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E5F;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x91CD;&#x8F7D;&#xFF0C;&#x5F53;&#x4E0D;&#x5B9A;&#x4E49;&#x6784;&#x9020;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x7ED9;&#x8BE5;&#x7C7B;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x65E0;&#x53C2;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x65B9;&#x4FBF;&#x8BE5;&#x7C7B;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x4F46;&#x8BE5;&#x7C7B;&#x4E2D;&#x81EA;&#x5B9A;&#x4E49;&#x4E86;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x9ED8;&#x8BA4;&#x6784;&#x9020;&#x51FD;&#x6570;&#x5C31;&#x6CA1;&#x6709;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4ECD;&#x8981;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x5728;&#x7C7B;&#x4E2D;&#x624B;&#x52A8;&#x6DFB;&#x52A0;&#x3002;</p>
<h4 id="44-&#x7C7B;&#x53D8;&#x91CF;&#x3001;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x548C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;">4.4 &#x7C7B;&#x53D8;&#x91CF;&#x3001;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x548C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;</h4>
<h6 id="441-&#x4F4D;&#x7F6E;&#x4E0D;&#x540C;">4.4.1 &#x4F4D;&#x7F6E;&#x4E0D;&#x540C;</h6>
<ol>
<li>&#x6210;&#x5458;&#x53D8;&#x91CF;&#x662F;&#x5728;&#x7C7B;&#x8303;&#x56F4;&#x5185;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x3002;</li>
<li>&#x7531;static&#x4FEE;&#x9970;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x79F0;&#x4E3A;&#x7C7B;&#x53D8;&#x91CF;&#xFF0C;&#x5B9E;&#x8D28;&#x662F;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3002;</li>
<li>&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x662F;&#x5B9A;&#x4E49;&#x5728;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x3002;&#x5305;&#x62EC;&#xFF1A;&#x5F62;&#x53C2;&#x3001;&#x65B9;&#x6CD5;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3001;&#x4EE3;&#x7801;&#x5757;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3002;</li>
</ol>
<h6 id="442-&#x521D;&#x59CB;&#x5316;">4.4.2 &#x521D;&#x59CB;&#x5316;</h6>
<ol>
<li>&#x6210;&#x5458;&#x53D8;&#x91CF;&#x5728;&#x5BF9;&#x8C61;&#x521D;&#x59CB;&#x5316;&#x7684;&#x65F6;&#x5019;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#x3002;</li>
<li>&#x7C7B;&#x53D8;&#x91CF;&#x5728;&#x7C7B;&#x52A0;&#x8F7D;&#x7684;&#x65F6;&#x5019;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#x3002;</li>
<li>&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x9664;&#x4E86;&#x5F62;&#x53C2;&#x5916;&#xFF0C;&#x90FD;&#x5FC5;&#x987B;&#x663E;&#x5F0F;&#x521D;&#x59CB;&#x5316;&#x3002;</li>
</ol>
<h6 id="443-&#x751F;&#x547D;&#x5468;&#x671F;">4.4.3 &#x751F;&#x547D;&#x5468;&#x671F;</h6>
<ol>
<li>&#x6210;&#x5458;&#x53D8;&#x91CF;&#x968F;&#x7740;&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#x800C;&#x5B58;&#x5728;&#xFF0C;&#x968F;&#x7740;&#x5BF9;&#x8C61;&#x7684;&#x56DE;&#x6536;&#x800C;&#x91CA;&#x653E;&#x3002;</li>
<li>&#x7C7B;&#x53D8;&#x91CF;&#x662F;&#x968F;&#x7740;&#x7C7B;&#x7684;&#x52A0;&#x8F7D;&#x800C;&#x5B58;&#x5728;&#xFF0C;&#x968F;&#x7740;&#x7C7B;&#x7684;&#x6D88;&#x5931;&#x800C;&#x6D88;&#x5931;&#x3002;</li>
<li>&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x662F;&#x968F;&#x7740;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x5F00;&#x59CB;&#x5165;&#x6808;&#x65F6;&#x521B;&#x5EFA;&#xFF0C;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x51FA;&#x6808;&#x65F6;&#x9500;&#x6BC1;</li>
</ol>
<h6 id="444-&#x6570;&#x636E;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#x4E0D;&#x540C;">4.4.4 &#x6570;&#x636E;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#x4E0D;&#x540C;</h6>
<ol>
<li>&#x6210;&#x5458;&#x53D8;&#x91CF;&#x5B58;&#x50A8;&#x5728;&#x5806;&#x5185;&#x5B58;&#x7684;&#x5BF9;&#x8C61;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x53EB;&#x5BF9;&#x8C61;&#x7684;&#x7279;&#x6709;&#x6570;&#x636E;&#x3002;</li>
<li>&#x7C7B;&#x53D8;&#x91CF;&#x5B58;&#x50A8;&#x5728;&#x65B9;&#x6CD5;&#x533A;&#xFF08;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x533A;&#xFF09;&#x7684;&#x9759;&#x6001;&#x533A;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x53EB;&#x5BF9;&#x8C61;&#x7684;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x3002;</li>
<li>&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5B58;&#x50A8;&#x5728;&#x6808;&#x5185;&#x5B58;&#x4E2D;</li>
</ol>
<h4 id="45-&#x4F5C;&#x7528;&#x57DF;">4.5 &#x4F5C;&#x7528;&#x57DF;</h4>
<h6 id="451--&#x5BF9;&#x8C61;&#x4F5C;&#x7528;&#x57DF;">4.5.1  &#x5BF9;&#x8C61;&#x4F5C;&#x7528;&#x57DF;</h6>
<ol>
<li>public &#xFF1A;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#x3001;&#x540C;&#x4E00;&#x4E2A;&#x5305;&#x4E0B;&#x3001;&#x5B50;&#x7C7B;&#x3001;&#x5176;&#x4ED6;&#x5305;&#x4E0B;&#x5BF9;&#x8C61;&#x90FD;&#x53EF;&#x4EE5;&#x8C03;&#x7528;</li>
<li>protected &#xFF1A;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#x3001;&#x540C;&#x4E00;&#x4E2A;&#x5305;&#x4E0B;&#x3001;&#x5B50;&#x7C7B;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x8C03;&#x7528;</li>
<li>default &#xFF1A;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#x3001;&#x540C;&#x4E00;&#x4E2A;&#x5305;&#x4E0B;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x8C03;&#x7528;</li>
<li>private &#xFF1A;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#xFF0C;&#x5E38;&#x7528;&#x6765;&#x4FEE;&#x9970;&#x6210;&#x5458;&#x53D8;&#x91CF;</li>
</ol>
<table>
<thead>
<tr>
<th></th>
<th style="text-align:center">&#x5BF9;&#x8C61;&#x672C;&#x8EAB;</th>
<th style="text-align:center">&#x540C;&#x4E00;&#x5305;&#x4E0B;</th>
<th style="text-align:center">&#x5B50;&#x7C7B;</th>
<th style="text-align:center">&#x5176;&#x4ED6;&#x5305;</th>
</tr>
</thead>
<tbody>
<tr>
<td>public</td>
<td style="text-align:center">&#x221A;</td>
<td style="text-align:center">&#x221A;</td>
<td style="text-align:center">&#x221A;</td>
<td style="text-align:center">&#x221A;</td>
</tr>
<tr>
<td>protected</td>
<td style="text-align:center">&#x221A;</td>
<td style="text-align:center">&#x221A;</td>
<td style="text-align:center">&#x221A;</td>
<td style="text-align:center"></td>
</tr>
<tr>
<td>friendly(default)</td>
<td style="text-align:center">&#x221A;</td>
<td style="text-align:center">&#x221A;</td>
<td style="text-align:center"></td>
<td style="text-align:center"></td>
</tr>
<tr>
<td>private</td>
<td style="text-align:center">&#x221A;</td>
<td style="text-align:center"></td>
<td style="text-align:center"></td>
</tr>
</tbody>
</table>
<h6 id="452-&#x53D8;&#x91CF;&#x4F5C;&#x7528;&#x57DF;">4.5.2 &#x53D8;&#x91CF;&#x4F5C;&#x7528;&#x57DF;</h6>
<ol>
<li>&#x7C7B;&#x7EA7;&#xFF1A;&#x7C7B;&#x7EA7;&#x53D8;&#x91CF;&#x53C8;&#x79F0;&#x5168;&#x5C40;&#x7EA7;&#x53D8;&#x91CF;&#x6216;&#x9759;&#x6001;&#x53D8;&#x91CF;&#xFF0C;&#x9700;&#x8981;&#x4F7F;&#x7528;static&#x5173;&#x952E;&#x5B57;&#x4FEE;&#x9970;&#x3002;&#x7C7B;&#x7EA7;&#x53D8;&#x91CF;&#x5728;&#x7C7B;&#x5B9A;&#x4E49;&#x540E;&#x5C31;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#xFF0C;&#x5360;&#x7528;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7C7B;&#x540D;&#x6765;&#x8BBF;&#x95EE;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5B9E;&#x4F8B;&#x5316;&#x3002;</li>
<li>&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x7EA7;&#xFF1A;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x7EA7;&#x53D8;&#x91CF;&#x5C31;&#x662F;&#x6210;&#x5458;&#x53D8;&#x91CF;&#xFF0C;&#x5B9E;&#x4F8B;&#x5316;&#x540E;&#x624D;&#x4F1A;&#x5206;&#x914D;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x624D;&#x80FD;&#x8BBF;&#x95EE;&#x3002;</li>
<li>&#x65B9;&#x6CD5;&#x7EA7;&#xFF1A;&#x65B9;&#x6CD5;&#x7EA7;&#x53D8;&#x91CF;&#x5C31;&#x662F;&#x5728;&#x65B9;&#x6CD5;&#x5185;&#x90E8;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5C31;&#x662F;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3002;</li>
<li>&#x5757;&#x7EA7;&#xFF1A;&#x5757;&#x7EA7;&#x53D8;&#x91CF;&#x5C31;&#x662F;&#x5B9A;&#x4E49;&#x5728;&#x4E00;&#x4E2A;&#x5757;&#x5185;&#x90E8;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x53D8;&#x91CF;&#x7684;&#x751F;&#x5B58;&#x5468;&#x671F;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x5757;&#x3002;</li>
</ol>
<p><img src="../image/16497232-b7d189a91faba426.png" alt="&#x53D8;&#x91CF;&#x4F5C;&#x7528;&#x57DF;"></p>
<p>&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>public class Test1 {

    private Integer a2 ;
    public static Integer a1 = 1;

    {
        int a4 = 4;
        System.out.println(&quot;&#x7C7B;&#x7EA7;&#x4EE3;&#x7801;&#x5757;a1&#xFF1A;&quot; + a1);
        System.out.println(&quot;&#x7C7B;&#x7EA7;&#x4EE3;&#x7801;&#x5757;a2&#xFF1A;&quot; + a2);
        //System.out.println(&quot;&#x7C7B;&#x7EA7;&#x4EE3;&#x7801;&#x5757;a3&#xFF1A;&quot; + a3);
        System.out.println(&quot;&#x7C7B;&#x7EA7;&#x4EE3;&#x7801;&#x5757;a4&#xFF1A;&quot; + a4);

    }

    public Test1(Integer a2) {
        this.a2 = a2;
    }

    public void abc(){
        int a3 = 3;
        {
            int b4 = 44;
            System.out.println(&quot;&#x65B9;&#x6CD5;&#x7EA7;&#x4EE3;&#x7801;&#x5757;a1&#xFF1A;&quot; + a1);
            System.out.println(&quot;&#x65B9;&#x6CD5;&#x7EA7;&#x4EE3;&#x7801;&#x5757;a2&#xFF1A;&quot; + a2);
            System.out.println(&quot;&#x65B9;&#x6CD5;&#x7EA7;&#x4EE3;&#x7801;&#x5757;a3&#xFF1A;&quot; + a3);
            System.out.println(&quot;&#x65B9;&#x6CD5;&#x7EA7;&#x4EE3;&#x7801;&#x5757;b4&#xFF1A;&quot; + b4);
        }

        System.out.println(&quot;&#x65B9;&#x6CD5;&#x7EA7;a1&#xFF1A;&quot; + a1);
        System.out.println(&quot;&#x65B9;&#x6CD5;&#x7EA7;a2&#xFF1A;&quot; + a2);
        System.out.println(&quot;&#x65B9;&#x6CD5;&#x7EA7;a3&#xFF1A;&quot; + a3);
        //System.out.println(a4);
        //System.out.println(b4);
    }

    public static void main(String[] args) {

        Test1 t = new Test1(2);
        System.out.println(&quot;============&quot;);
        t.abc();
    }
}
</code></pre><blockquote>
<p>&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#xFF1A;</p>
<p>&#x7C7B;&#x7EA7;&#x4EE3;&#x7801;&#x5757;a1&#xFF1A;1
&#x7C7B;&#x7EA7;&#x4EE3;&#x7801;&#x5757;a2&#xFF1A;null
&#x7C7B;&#x7EA7;&#x4EE3;&#x7801;&#x5757;a4&#xFF1A;4</p>
<p>============</p>
<p>&#x65B9;&#x6CD5;&#x7EA7;&#x4EE3;&#x7801;&#x5757;a1&#xFF1A;1
&#x65B9;&#x6CD5;&#x7EA7;&#x4EE3;&#x7801;&#x5757;a2&#xFF1A;2
&#x65B9;&#x6CD5;&#x7EA7;&#x4EE3;&#x7801;&#x5757;a3&#xFF1A;3
&#x65B9;&#x6CD5;&#x7EA7;&#x4EE3;&#x7801;&#x5757;b4&#xFF1A;44</p>
<p>&#x65B9;&#x6CD5;&#x7EA7;a1&#xFF1A;1
&#x65B9;&#x6CD5;&#x7EA7;a2&#xFF1A;2
&#x65B9;&#x6CD5;&#x7EA7;a3&#xFF1A;3</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="值-引用传递.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 值传递、引用传递">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"封装、继承、多态","level":"1.2.4","depth":2,"next":{"title":"Java基础知识","level":"1.3","depth":1,"ref":"","articles":[{"title":"基本数据类型","level":"1.3.1","depth":2,"path":"java_base/基本数据类型.md","ref":"java_base/基本数据类型.md","articles":[]},{"title":"String类型","level":"1.3.2","depth":2,"path":"java_base/String类型.md","ref":"java_base/String类型.md","articles":[]},{"title":"Java关键字","level":"1.3.3","depth":2,"path":"java_base/Java关键字.md","ref":"java_base/Java关键字.md","articles":[]},{"title":"Java集合","level":"1.3.4","depth":2,"path":"java_base/Java集合.md","ref":"java_base/Java集合.md","articles":[{"title":"Collection","level":"1.3.4.1","depth":3,"path":"java_base/Collection.md","ref":"java_base/Collection.md","articles":[]},{"title":"Map","level":"1.3.4.2","depth":3,"path":"java_base/Map.md","ref":"java_base/Map.md","articles":[]}]},{"title":"枚举","level":"1.3.5","depth":2,"path":"java_base/enum.md","ref":"java_base/enum.md","articles":[]},{"title":"Java IO","level":"1.3.6","depth":2,"path":"java_base/java_io.md","ref":"java_base/java_io.md","articles":[]},{"title":"序列化","level":"1.3.7","depth":2,"path":"java_base/serializable.md","ref":"java_base/serializable.md","articles":[]},{"title":"注解","level":"1.3.8","depth":2,"path":"java_base/annotation.md","ref":"java_base/annotation.md","articles":[]},{"title":"Lambda","level":"1.3.9","depth":2,"path":"java_base/lambda.md","ref":"java_base/lambda.md","articles":[]}]},"previous":{"title":"值传递、引用传递","level":"1.2.3","depth":2,"path":"oop/值-引用传递.md","ref":"oop/值-引用传递.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"oop/封装继承多态.md","mtime":"2019-04-25T07:26:04.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-05-05T12:22:42.400Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

